"""
    python正则表达式使用元字符匹配
"""
import re

# s = "The way things @@ !! ## 456 go "
# # 找数字
# res = re.findall('[a-zA-Z3-9]', s)  # 字符串前带上r的标记 表示字符串转义字符无效
# print(res)

# 匹配账号 只能由数字和字母组成 长度限制6-10位
# r = '^[0-9A-Za-z]{6,10}$'  # 小符号开头结尾加上 表示查询整体 否则也会查询子串
# s = '12345678'
# print(re.findall(r, s))

# 匹配QQ号 要求纯数字 长度5-11 第一位不为0
# r = '^[1-9][0-9]{4,10}$'
# s = '12345678'
# print(re.findall(r, s))

# 匹配邮箱地址 只允许qq、163、gmail这三种邮箱地址
# {内容}.{内容}{内容}.{内容}@{内容}.{内容}.{内容}{内容}
r = r'(^[\w-]+(\.[\w-]+)*@(qq|163|gmail)+(\.[\w-]+)+$)'
s = 'a.b.c.d@qq.com'
print(re.match(r, s).group())
